public class Main {


//    - 6 билет

//    1. Назовите все методы класса Object.
//    2. Что такое сигнатура метода?
//    3. Какие есть способы создания объекта String? Где он создается?
//    4. Зачем в Java такое многообразие имплементации динамического массива?
//    5. Дайте определение понятию exception (исключительная ситуация).
//    6. Как остановить поток?

//    - Задача
//
//    Напишите методы Equals and HashCode для класса Student, который состоит из полей String name и int age.

    public static void main(String[] args) {


    }
}